
#include"Calcul.h"

void CalMenu()
{
	cout << "###############################################################" << endl;
	cout << "####################   ---欢迎使用计算器---     ###############" << endl;
	cout << "####################    1.开始计算              ###############" << endl;
	cout << "####################    2.使用方法              ###############" << endl;
	cout << "####################    0.退出                  ###############" << endl;
	cout << "###############################################################" << endl;
}
void Usage()    //表达式输入规则
{
	cout << "Usage:" << endl;
	cout << "###############################################################" << endl;
	cout << "example:1+2-3*4+5/6+(-1*2)" << endl;
	cout << "Usage:1+2-3*4+5/6((0-1)*2)" << endl;
	cout << "使用负数时-1，其格式为(0-1)作为负数的输入" << endl;;
	cout << "###############################################################" << endl;
	cout << endl;
}
int main()
{
	while (1)
	{
		CalMenu();
		int num = 0;
		cout << "请选择：";
		cin >> num;
		switch (num)
		{
		case 1:
			Calcul();
			break;
		case 2:
			Usage();
			break;
		case 0:
			exit(1);
		default:
			cout << "输入错误！请重新输入！" << endl;
		}
	}
	system("pause");
	return 0;
}